In [1]:
%load_ext sql

In [2]:
%sql sqlite:///ABC.db

In [3]:
%%sql
CREATE TABLE customers(
  customer_ID INT PRIMARY KEY,
  customer_first_name VARCHAR(20),
  customer_last_name VARCHAR(20),
  customer_email VARCHAR(20)
);

 * sqlite:///ABC.db
Done.

[]

In [4]:
%%sql
CREATE TABLE products(
  product_ID INT PRIMARY KEY,
  product_name VARCHAR(15),
  product_price VARCHAR(15)
);

 * sqlite:///ABC.db
Done.

[]

In [5]:
%%sql
CREATE TABLE orders(
  order_ID INT PRIMARY KEY,
  customer_ID VARCHAR(15),
  order_date VARCHAR(15)
);

 * sqlite:///ABC.db
Done.

[]

In [6]:
%%sql
CREATE TABLE order_items(
  order_ID INT PRIMARY KEY,
  product_ID VARCHAR(15),
  order_quantity VARCHAR(15)
);

 * sqlite:///ABC.db
Done.

[]

In [7]:
%%sql
INSERT INTO customers (customer_ID, customer_first_name, customer_last_name, customer_email) VALUES
    (1, 'Jack', 'San', 'jacksan@email.com'),
    (2, 'John', 'Sam', 'johnsam@email.com'),
    (3, 'Bob', 'Tabuke', 'bobtabuke@email.com'),
    (4, 'Rine', 'Shiko', 'rineshiko@email.com'),
    (5, 'Emmah', 'Nyamai', 'emmahnyamai@email.com'),
    (6, 'Victor', 'Korat', 'victorkorat@email.com'),
    (7, 'Edith', 'Malabi', 'edithmalabi@email.com'),
    (8, 'Brenda', 'kawira', 'brendakawira@email.com'),
    (9, 'Kevin', 'Karanja', 'kevinkaranja@email.com'),
    (10, 'Prudence', 'Joy', 'prudencejoy@email.com');

 * sqlite:///ABC.db
10 rows affected.

[]

In [8]:
%%sql
INSERT INTO products (product_ID, product_name, product_price) VALUES
    (1, 'Product A', 98000.00),
    (2, 'Product B', 70000.00),
    (3, 'Product C', 12000.00),
    (4, 'Product D', 21500.00),
    (5, 'Product E', 43000.00),
    (6, 'Product F', 65000.00),
    (7, 'Product G', 76000.00),
    (8, 'Product H', 88000.00),
    (9, 'Product I', 10000.00),
    (10, 'Product J', 11000.00);

 * sqlite:///ABC.db
10 rows affected.

[]

In [9]:
%%sql
 INSERT INTO orders (order_ID, customer_ID, order_date) VALUES
    (1, 1, '2024-01-10'),
    (2, 3, '2024-01-20'),
    (3, 3, '2024-02-13'),
    (4, 10, '2024-01-24'),
    (5, 9, '2024-01-25'),
    (6, 3, '2024-01-16'),
    (7, 4, '2024-01-17'),
    (8, 5, '2024-01-16'),
    (9, 2, '2024-01-26'),
    (10, 7, '2024-02-10'),
    (11, 6, '2024-01-29'),
    (12, 9, '2024-01-12'),
    (13, 10, '2024-02-13'),
    (14, 4, '2024-01-18'),
    (15, 1, '2024-01-15');

 * sqlite:///ABC.db
15 rows affected.

[]

In [10]:
%%sql
INSERT INTO order_items (order_ID, product_ID, order_quantity) VALUES
    (1, 2, 10),
    (2, 2, 10),
    (3, 1, 15),
    (4, 2, 14),
    (5, 1, 11),
    (6, 1, 10),
    (7, 4, 12),
    (8, 6, 5),
    (9, 9, 10),
    (10, 1, 5),
    (11, 3, 6),
    (12, 9, 2),
    (13, 2, 3),
    (14, 6, 3),
    (15, 6, 10);

 * sqlite:///ABC.db
15 rows affected.

[]

In [11]:
%%sql
SELECT * FROM customers

 * sqlite:///ABC.db
Done.

[(1, 'Jack', 'San', 'jacksan@email.com'),
 (2, 'John', 'Sam', 'johnsam@email.com'),
 (3, 'Bob', 'Tabuke', 'bobtabuke@email.com'),
 (4, 'Rine', 'Shiko', 'rineshiko@email.com'),
 (5, 'Emmah', 'Nyamai', 'emmahnyamai@email.com'),
 (6, 'Victor', 'Korat', 'victorkorat@email.com'),
 (7, 'Edith', 'Malabi', 'edithmalabi@email.com'),
 (8, 'Brenda', 'kawira', 'brendakawira@email.com'),
 (9, 'Kevin', 'Karanja', 'kevinkaranja@email.com'),
 (10, 'Prudence', 'Joy', 'prudencejoy@email.com')]

In [12]:
%%sql
SELECT * FROM products

 * sqlite:///ABC.db
Done.

[(1, 'Product A', '98000.0'),
 (2, 'Product B', '70000.0'),
 (3, 'Product C', '12000.0'),
 (4, 'Product D', '21500.0'),
 (5, 'Product E', '43000.0'),
 (6, 'Product F', '65000.0'),
 (7, 'Product G', '76000.0'),
 (8, 'Product H', '88000.0'),
 (9, 'Product I', '10000.0'),
 (10, 'Product J', '11000.0')]

In [13]:
%%sql
SELECT * FROM orders

 * sqlite:///ABC.db
Done.

[(1, '1', '2024-01-10'),
 (2, '3', '2024-01-20'),
 (3, '3', '2024-02-13'),
 (4, '10', '2024-01-24'),
 (5, '9', '2024-01-25'),
 (6, '3', '2024-01-16'),
 (7, '4', '2024-01-17'),
 (8, '5', '2024-01-16'),
 (9, '2', '2024-01-26'),
 (10, '7', '2024-02-10'),
 (11, '6', '2024-01-29'),
 (12, '9', '2024-01-12'),
 (13, '10', '2024-02-13'),
 (14, '4', '2024-01-18'),
 (15, '1', '2024-01-15')]

In [14]:
%%sql
SELECT * FROM order_items

 * sqlite:///ABC.db
Done.

[(1, '2', '10'),
 (2, '2', '10'),
 (3, '1', '15'),
 (4, '2', '14'),
 (5, '1', '11'),
 (6, '1', '10'),
 (7, '4', '12'),
 (8, '6', '5'),
 (9, '9', '10'),
 (10, '1', '5'),
 (11, '3', '6'),
 (12, '9', '2'),
 (13, '2', '3'),
 (14, '6', '3'),
 (15, '6', '10')]

Select product with the highest price.

In [15]:
%%sql
SELECT * FROM products ORDER BY product_price DESC limit 1

 * sqlite:///ABC.db
Done.

[(1, 'Product A', '98000.0')]

Select order_id with highest no. of items interms of quantity.

In [27]:
%%sql
SELECT order_ID, COUNT(*) FROM order_items GROUP BY order_quantity

 * sqlite:///ABC.db
Done.

[(1, 5), (5, 1), (7, 1), (4, 1), (3, 1), (12, 1), (13, 2), (8, 2), (11, 1)]

In [31]:
%%sql
WITH order_counts AS (
  SELECT customer_ID, COUNT(order_ID) AS order_count
  FROM orders
  GROUP BY customer_ID
),
max_order_count AS (
  SELECT MAX(order_count) AS max_count
  FROM order_counts
)
SELECT c.customer_first_name, c.customer_last_name
FROM customers c
JOIN order_counts oc ON c.customer_ID = oc.customer_ID
JOIN max_order_count moc ON oc.order_count = moc.max_count;

 * sqlite:///ABC.db
Done.

[('Bob', 'Tabuke')]

Total revenue per product.

In [35]:
%%sql
SELECT p.product_name,
       p.product_price * SUM(oi.order_quantity) AS total_revenue
FROM products p
JOIN order_items oi ON oi.product_id = p.product_id
GROUP BY p.product_name, p.product_price
ORDER BY 2 DESC;

 * sqlite:///ABC.db
Done.

[('Product A', 4018000.0),
 ('Product B', 2590000.0),
 ('Product F', 1170000.0),
 ('Product D', 258000.0),
 ('Product I', 120000.0),
 ('Product C', 72000.0)]